ps-Net-SSH-Any.org
#+Title: Net::SSH::Any

#+Author: Salvador Fandiño
#+Email: sfandino@yahoo.com

#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+OPTIONS: ^:nil
#+REVEAL_THEME: black

* SSH 201

** The protocol, roughly

Two stages:

1. Handshaking: connection setup, version negotiation, encryption, compression, remote host authentication, client authentication.

2. Data transfer: channels.


** The SSH channel

- Bidirectional stream between server and client (=in=, =out=, =err=).

- Can be initiated by both server and client.

- Created and destroyed dynamically.

- One SSH connection can run several channels in parallel.

- End-point types:

  - standard: =shell=, =exec=, =tcp-ip=, =X11=, =agent=, =subsystem=, etc.

  - extensions: =UNIX=, =vpn=, etc. (OpenSSH)

- =shell/exec= specific operations: exit/signal code, send signal.

** Shell Vs. exec

- =shell= → runs an interactive session - bad for automation:

  #+BEGIN_SRC sh
  $ ssh host
  # ==> /bin/sh -i
  #+END_SRC

- =exec= → tells the shell to run a single command:

  #+BEGIN_SRC sh
  $ ssh host $cmd
  # ==> /bin/sh -c $cmd
  #+END_SRC

** On top of SSH

These are not protocol extensions but just commands and protocols that (can) use a SSH channel as the transport layer:

- =scp=, =rsync=, =git=, etc.

- =SFTP= (subsystem)

** Popular implementations

- Full client+server implementations
  - [[http://www.openssh.com/][*OpenSSH*]] and forks.
  - [[http://www.ssh.com/products/tectia-ssh][Tectia SSH]] (proprietary).
  - [[https://matt.ucc.asn.au/dropbear/dropbear.html][Dropbear]]

- Libraries
  - [[http://www.libssh.org/][libssh]]: server and client, buggy, used by GitHub.
  - [[http://libssh2.org/][libssh2]]: client only, buggy, used by curl.
  - libopenssh: OpenSSH as a library, WIP.

- Programming language specific
  - Python: [[http://www.paramiko.org/][paramiko]]
  - Perl: [[https://metacpan.org/pod/Net::SSH::Perl][=Net::SSH::Perl=]]
  - Java, C#, etc.

- OS specific: Windows, VMS, etc.

** Implementing SSH is hard!


* Perl & SSH

** Several ways:

- =system "ssh $target $cmd";=: publickey auth only, inefficient, slow.

- [[https://metacpan.org/pod/Expect][=Expect=]], [[https://metacpan.org/pod/Net::SSH::Expect][=Net::SSH::Expect=]]: talking to the shell, unreliable.

- [[https://metacpan.org/pod/Net::SSH::Perl][=Net::SSH::Perl=]]: old, [[https://rt.cpan.org/Dist/Display.html?Name=Net-SSH-Perl][buggy]], barely maintained, very difficult installation.

- [[https://metacpan.org/pod/Net::SSH2][=Net::SSH2=]]: low level, C-ish, insecure by default.

- [[https://metacpan.org/pod/Net::OpenSSH][=Net::OpenSSH=]]: high level and perlish but no Windows.

- ...

** No one's perfect!

** What do we need?

- Powerful, easy to use, perlish API.

- Easy to install (restricted environments).

- Robust, efficient, stable.

- Portable: Windows, POSIX & BSD.

- Shell and command mode.

- Support for SFTP and SCP.


* Net::SSH::Any

** Warning

I am talking today about the development version today!

http://github.com/salva/p5-Net-SSH-Any

** The idea

The idea behind [[https://metacpan.org/pod/Net::SSH::Any][Net::SSH::Any]] is to have a set of plugable backends providing support for the most low level SSH operations and then build other more powerful abstractions on top of that.

** The backends

- =Net_OpenSSH=:
  - Requires =Net::OpenSSH= and the OpenSSH client.
  - Reliable, stable, fast.
  - No Windows.

- =Net_SSH2=:
  - Requires =Net::SSH2= and =libssh2=.
  - Fast. Reliability and stability [[http://blogs.perl.org/users/salvador_fandino/2015/08/help-me-test-netssh2.html][improving]].

- =(Ssh|Plink|Dbclient|Sexec|Sshg3)_Cmd=
  - Runs almost anywhere where a SSH client is installed.
  - Inefficient → slow.
  - Feature support varies, usually a SMOP.

** The API

Initially, a subset of =Net::OpenSSH= API - The most useful methods and features that could be implemented on top of =Net::SSH2=.

But then it got its own life...

*** Constructor and connecting

#+BEGIN_SRC cperl
my $ssh1 = Net::SSH::Any->new($target, %opts);
my $ssh2 = Net::SSH::Any->new($host, user => $user, password => $pwd);
my $ssh3 = Net::SSH::Any->new($host,
                              backends => [qw(Net_SSH2 Plink_Cmd)],
			      local_plink_cmd => 'C:\\\\PuTTY\\plink.exe');
#+END_SRC

Valid options: =user=, =port=, =password=, =key_path=, =passphrase=, =batch_mode=, =timeout=, =encoding=, =argument_encoding=, =stream_encoding=, =remote_shell=, =known_hosts_path=, =strict_host_key_checking=, =remote_*_cmd=, =local_*_cmd=, =backends=, =backend_opts=.

*** Running remote commands

- =system=: runs remote command redirecting the output to local file descriptors - =STDOUT= and =STDERR= by default:

  #+BEGIN_SRC cperl
  my $ok = $ssh->system($cmd);
  #+END_SRC

- =capture2=: runs remote command capturing both =stdout= and =stderr=:

  #+BEGIN_SRC cperl
  my ($out, $err) = $ssh->capture2($cmd)
  #+END_SRC

- =capture=: captures =stdout=, sends =stderr= to file descriptor:

  #+BEGIN_SRC cperl
  my $out = $ssh->capture($cmd);
  my @out = $ssh->capture($cmd);
  #+END_SRC

