ps-Net-SSH-Any.org
*** Optional method arguments

#+BEGIN_SRC cperl
my $ok = $ssh->system({ stdout_file => "/fmp/foo.out",
                        stderr_to_stdout => 1,
                        timeout => 10 },
                      $cmd);
#+END_SRC

Valid options: =timeout=, =stdin_data=, =stdout_fh=, =stdout_file=, =stdout_discard=, =stderr_to_stdout=, =stderr_fh=, =stderr_file=, =stderr_discard=, =quote_args=, =glob_quoting=, =encoding=, =stream_encoding=, =argument_encoding=, =remote_shell=

*** STDIN for the remote command

- Default: =</dev/null=

- Read from local file descriptor:

  #+BEGIN_SRC cperl
  my $out = $ssh->capture({ stdin_fh => \*STDIN }, $cmd);
  #+END_SRC

- Read from a perl variable:

  #+BEGIN_SRC cperl
  my $out = $ssh->capture({ stdin_data => "Use the force, Luke!\n" },
                          $cmd);
  #+END_SRC


*** Talking to the remote shell

#+BEGIN_SRC cperl
my @cmds = ('enable', 'show config net', 'exit');
my $output = $ssh->capture({ stdin_data => join("\r\n", @cmds, '') });
                           # look mum, no $cmd!
#+END_SRC

*** Argument quoting

Imitate Perl built-ins:

- one argument → no quoting, pass it as given:

  #+BEGIN_SRC cperl
  my $txt = <>;
  $ssh->system("echo $txt"); # don't!
  #+END_SRC

- several arguments → quote them using specific remote shell rules (i.e. =bash=, =ksh=, =csh=, etc.):

  #+BEGIN_SRC cperl
  $ssh->system("echo", $txt); # safe
  #+END_SRC

- override:

  #+BEGIN_SRC cperl
  $ssh->system({quote_args => 1}, '/bin/I am>a*cool$cmd');
  #+END_SRC

*** Advanced argument quoting

The remote shell is unavoidable... we can take advantage of that!

- Glob quoting, wildcards pass unquoted:

  #+BEGIN_SRC cperl
  my @fns = $ssh->capture(ls => \"*.txt");
  #+END_SRC

- Unquoted fragments:

  #+BEGIN_SRC cperl
  my @cmd1 = ('cd', q(Music/The Ramones/Hey! Ho! Let's Go'));
  my @cmd2 = ('mplayer', q(53rd & 3rd));
  my $ssh->system(@cmd1, \\'&&', @cmd2)
  # actual remote cmd:
  #   cd 'Music/The Ramones/Hey! Ho! Let'\''s Go'\' && mplayer '53rd & 3rd'

  my $ssh->system(foonolizator => $src, \\'>/tmp/log 2>&1');
  #+END_SRC

*** Quoting for other shells and OSs

- MS Windows:

  #+BEGIN_SRC cperl
  my $ssh = Net::SSH::Any->new($host, ...,
                               remote_shell => 'MSWin');
  $ssh->system({ quote_args=> 1 },
               'C:\\\\Program Files\\Bar\\bar.exe');
  # there is more than that for Windows!
  #+END_SRC

- POSIX - default

- =csh=

- =fish= (WIP)

- ?

*** The dpipe method

  #+BEGIN_SRC cperl
  my $dpipe = $ssh->dpipe($cmd);
  #+END_SRC

- Returns a bidirectional stream handle (similar to =IO::Socket=).

- Blocking and -almost- non-blocking usage.

- A WIP, but already heavily used internally (i.e. =SCP=).


** SCP

=Net::SSH::Any= has its own full, pure-Perl SCP implementation.

#+BEGIN_SRC cperl
my $ok = $ssh->scp_get($remote_from, $local_to);
my $ok = $ssh->scp_put($local_from, $remote_to);
my $data = $ssh->scp_get_content($remote_from);
my $ok = $ssh->scp_put_content($remote_to, $data);
#+END_SRC

Valid options: =glob=, =recursive=, =copy_attr=, =copy_perm=, =copy_time=, =update=, =overwrite=, =numbered=.

** Abusing SCP

  #+BEGIN_SRC cperl
  my $ok = $ssh->scp_mkdir($remote_dir);

  my @files = $ssh->scp_find($remote_dir); # WIP
  #+END_SRC

** SFTP

#+BEGIN_SRC cperl
my $sftp = $ssh->sftp;
$sftp->put($src, $target);
#+END_SRC

- Returns a [[https://metacpan.org/pod/Net::SFTP::Foreign][=Net::SFTP::Foreign=]] object.

- Stable, feature rich, easy to use module... and I am the author too :-)

- Still requiring some work on the =Net_SSH2= backend.

** Other features

- Timeouts.

- Error handling.

- Argument and data stream encoding.

- Connection forwarding - a-la =netcat=.


** Net::SSH::Any::Test

Testing helper for SSH: I need to connect somewhere!

- Look for a running SSH server or start a new one or whatever.

- Redesign of my (discontinued) [[https://metacpan.org/pod/Test::SSH][=Test::SSH=]].

- Very WIP.


** Future work

- Stabilize. Fix bugs. Fix =Net::SSH2=.

- Complete backend feature coverage.

- Integrate or assimilate other modules:

  - [[https://metacpan.org/pod/Remote::Object][=Remote::Object=]]

  - Modules by Oliver Gorwits: [[https://metacpan.org/pod/Net::CLI::Interact][=Net::CLI::Interact=]], [[https://metacpan.org/pod/Net::Appliance::Phrasebook][=Net::Appliance::Phrasebook=]], etc.

  - [[https://www.rexify.org/][=Rex=]]

- More backends: =Net::SSH::Perl=, =Local=, ?

- Hard to do: gateway support, async/parallel mode, integrate external commands =rsync=, =git=, etc.

- Feedback welcome!


* Conclusions

