ps-Net-SSH-Any.html
<section id="slide-orgheadline17">
<h4 id="orgheadline17">Optional method arguments</h4>
<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ok</span> = $ssh-&gt;<span style="color: #228b22;">system</span>({ <span style="color: #8b2252;">stdout_file</span> =&gt; <span style="color: #8b2252;">"/fmp/foo.out"</span>,
                        <span style="color: #8b2252;">stderr_to_stdout</span> =&gt; 1,
                        <span style="color: #8b2252;">timeout</span> =&gt; 10 },
                      $cmd);
</pre>
</div>

<p>
Valid options: <code>timeout</code>, <code>stdin_data</code>, <code>stdout_fh</code>, <code>stdout_file</code>, <code>stdout_discard</code>, <code>stderr_to_stdout</code>, <code>stderr_fh</code>, <code>stderr_file</code>, <code>stderr_discard</code>, <code>quote_args</code>, <code>glob_quoting</code>, <code>encoding</code>, <code>stream_encoding</code>, <code>argument_encoding</code>, <code>remote_shell</code>
</p>

</section>
<section id="slide-orgheadline18">
<h4 id="orgheadline18">STDIN for the remote command</h4>
<ul>
<li>Default: <code>&lt;/dev/null</code></li>

<li><p>
Read from local file descriptor:
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$out</span> = $ssh-&gt;capture({ <span style="color: #8b2252;">stdin_fh</span> =&gt; \*STDIN }, $cmd);
</pre>
</div></li>

<li><p>
Read from a perl variable:
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$out</span> = $ssh-&gt;capture({ <span style="color: #8b2252;">stdin_data</span> =&gt; <span style="color: #8b2252;">"Use the force, Luke!\n"</span> },
                        $cmd);
</pre>
</div></li>

</ul>


</section>
<section id="slide-orgheadline19">
<h4 id="orgheadline19">Talking to the remote shell</h4>
<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@cmds</span> = (<span style="color: #8b2252;">'enable'</span>, <span style="color: #8b2252;">'show config net'</span>, <span style="color: #8b2252;">'exit'</span>);
<span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$output</span> = $ssh-&gt;capture({ <span style="color: #8b2252;">stdin_data</span> =&gt; <span style="color: #228b22;">join</span>(<span style="color: #8b2252;">"\r\n"</span>, <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@cmds</span>, <span style="color: #8b2252;">''</span>) });
                           <span style="color: #b22222;"># </span><span style="color: #b22222;">look mum, no $cmd!</span>
</pre>
</div>

</section>
<section id="slide-orgheadline20">
<h4 id="orgheadline20">Argument quoting</h4>
<p>
Imitate Perl built-ins:
</p>

<ul>
<li><p>
one argument → no quoting, pass it as given:
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$txt</span> = &lt;&gt;;
$ssh-&gt;<span style="color: #228b22;">system</span>(<span style="color: #8b2252;">"echo $txt"</span>); <span style="color: #b22222;"># </span><span style="color: #b22222;">don't!</span>
</pre>
</div></li>

<li><p>
several arguments → quote them using specific remote shell rules (i.e. <code>bash</code>, <code>ksh</code>, <code>csh</code>, etc.):
</p>

<div class="org-src-container">

<pre  class="src src-cperl">$ssh-&gt;<span style="color: #228b22;">system</span>(<span style="color: #8b2252;">"echo"</span>, $txt); <span style="color: #b22222;"># </span><span style="color: #b22222;">safe</span>
</pre>
</div></li>

<li><p>
override:
</p>

<div class="org-src-container">

<pre  class="src src-cperl">$ssh-&gt;<span style="color: #228b22;">system</span>({<span style="color: #8b2252;">quote_args</span> =&gt; 1}, <span style="color: #8b2252;">'/bin/I am&gt;a*cool$cmd'</span>);
</pre>
</div></li>

</ul>

</section>
<section id="slide-orgheadline21">
<h4 id="orgheadline21">Advanced argument quoting</h4>
<p>
The remote shell is unavoidable&#x2026; we can take advantage of that!
</p>

<ul>
<li><p>
Glob quoting, wildcards pass unquoted:
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@fns</span> = $ssh-&gt;capture(<span style="color: #8b2252;">ls</span> =&gt; \<span style="color: #8b2252;">"*.txt"</span>);
</pre>
</div></li>

<li><p>
Unquoted fragments:
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@cmd1</span> = (<span style="color: #8b2252;">'cd'</span>, <span style="color: #66cd00;">q</span><span style="color: #8b2252;">(Music/The Ramones/Hey! Ho! Let's Go')</span>);
<span style="color: #a020f0;">my</span> <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@cmd2</span> = (<span style="color: #8b2252;">'mplayer'</span>, <span style="color: #66cd00;">q</span><span style="color: #8b2252;">(53rd &amp; 3rd)</span>);
<span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ssh</span>-&gt;<span style="color: #228b22;">system</span>(<span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@cmd1</span>, \\<span style="color: #8b2252;">'&amp;&amp;'</span>, <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@cmd2</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">actual remote cmd:</span>
<span style="color: #b22222;">#   </span><span style="color: #b22222;">cd 'Music/The Ramones/Hey! Ho! Let'\''s Go'\' &amp;&amp; mplayer '53rd &amp; 3rd'</span>

<span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ssh</span>-&gt;<span style="color: #228b22;">system</span>(<span style="color: #8b2252;">foonolizator</span> =&gt; $src, \\<span style="color: #8b2252;">'&gt;/tmp/log 2&gt;&amp;1'</span>);
</pre>
</div></li>

</ul>

</section>
<section id="slide-orgheadline22">
<h4 id="orgheadline22">Quoting for other shells and OSs</h4>
<ul>
<li><p>
MS Windows:
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ssh</span> = Net::SSH::Any-&gt;new($host, ...,
                             <span style="color: #8b2252;">remote_shell</span> =&gt; <span style="color: #8b2252;">'MSWin'</span>);
$ssh-&gt;<span style="color: #228b22;">system</span>({ <span style="color: #8b2252;">quote_args</span>=&gt; 1 },
             <span style="color: #8b2252;">'C:\\\\Program Files\\Bar\\bar.exe'</span>);
<span style="color: #b22222;"># </span><span style="color: #b22222;">there is more than that for Windows!</span>
</pre>
</div></li>

<li>POSIX - default</li>

<li><code>csh</code></li>

<li><code>fish</code> (WIP)</li>

<li>?</li>

</ul>

</section>
<section id="slide-orgheadline23">
<h4 id="orgheadline23">The dpipe method</h4>
<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$dpipe</span> = $ssh-&gt;dpipe($cmd);
</pre>
</div>

<ul>
<li>Returns a bidirectional stream handle (similar to <code>IO::Socket</code>).</li>

<li>Blocking and -almost- non-blocking usage.</li>

<li>A WIP, but already heavily used internally (i.e. <code>SCP</code>).</li>

</ul>


</section>
<section id="slide-orgheadline25">
<h3 id="orgheadline25">SCP</h3>
<p>
<code>Net::SSH::Any</code> has its own full, pure-Perl SCP implementation.
</p>

<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ok</span> = $ssh-&gt;scp_get($remote_from, $local_to);
<span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ok</span> = $ssh-&gt;scp_put($local_from, $remote_to);
<span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$data</span> = $ssh-&gt;scp_get_content($remote_from);
<span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ok</span> = $ssh-&gt;scp_put_content($remote_to, $data);
</pre>
</div>

<p>
Valid options: <code>glob</code>, <code>recursive</code>, <code>copy_attr</code>, <code>copy_perm</code>, <code>copy_time</code>, <code>update</code>, <code>overwrite</code>, <code>numbered</code>.
</p>

</section>
<section id="slide-orgheadline26">
<h3 id="orgheadline26">Abusing SCP</h3>
<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$ok</span> = $ssh-&gt;scp_mkdir($remote_dir);

<span style="color: #a020f0;">my</span> <span style="color: #0000ff; background-color: #eeeed1; font-weight: bold;">@files</span> = $ssh-&gt;scp_find($remote_dir); <span style="color: #b22222;"># </span><span style="color: #b22222;">WIP</span>
</pre>
</div>

</section>
<section id="slide-orgheadline27">
<h3 id="orgheadline27">SFTP</h3>
<div class="org-src-container">

<pre  class="src src-cperl"><span style="color: #a020f0;">my</span> <span style="color: #a0522d;">$sftp</span> = $ssh-&gt;sftp;
$sftp-&gt;put($src, $target);
</pre>
</div>

<ul>
<li>Returns a <a href="https://metacpan.org/pod/Net::SFTP::Foreign"><code>Net::SFTP::Foreign</code></a> object.</li>

<li>Stable, feature rich, easy to use module&#x2026; and I am the author too :-)</li>

<li>Still requiring some work on the <code>Net_SSH2</code> backend.</li>

</ul>

</section>
<section id="slide-orgheadline28">
<h3 id="orgheadline28">Other features</h3>
<ul>
<li>Timeouts.</li>

<li>Error handling.</li>

<li>Argument and data stream encoding.</li>

<li>Connection forwarding - a-la <code>netcat</code>.</li>

</ul>


</section>
<section id="slide-orgheadline29">
<h3 id="orgheadline29">Net::SSH::Any::Test</h3>
<p>
Testing helper for SSH: I need to connect somewhere!
</p>

<ul>
<li>Look for a running SSH server or start a new one or whatever.</li>

<li>Redesign of my (discontinued) <a href="https://metacpan.org/pod/Test::SSH"><code>Test::SSH</code></a>.</li>

<li>Very WIP.</li>

</ul>


</section>
<section id="slide-orgheadline30">
<h3 id="orgheadline30">Future work</h3>
<ul>
<li>Stabilize. Fix bugs. Fix <code>Net::SSH2</code>.</li>

<li>Complete backend feature coverage.</li>

<li>Integrate or assimilate other modules:

<ul>
<li><a href="https://metacpan.org/pod/Remote::Object"><code>Remote::Object</code></a></li>

<li>Modules by Oliver Gorwits: <a href="https://metacpan.org/pod/Net::CLI::Interact"><code>Net::CLI::Interact</code></a>, <a href="https://metacpan.org/pod/Net::Appliance::Phrasebook"><code>Net::Appliance::Phrasebook</code></a>, etc.</li>

<li><a href="https://www.rexify.org/"><code>Rex</code></a></li>

</ul></li>

<li>More backends: <code>Net::SSH::Perl</code>, <code>Local</code>, ?</li>

<li>Hard to do: gateway support, async/parallel mode, integrate external commands <code>rsync</code>, <code>git</code>, etc.</li>

<li>Feedback welcome!</li>

</ul>


</section>
</section>
